---
kind: property
id: P:Autodesk.Revit.DB.TableCellStyle.TextOrientation
source: html/5ae0964a-266b-ba4f-5e7d-c4b82bd636cc.htm
---
# Autodesk.Revit.DB.TableCellStyle.TextOrientation Property

The orientation of the cell (for vertical/horizontal text) with input in degrees multiplied by 10

## Syntax (C#)
```csharp
public int TextOrientation { get; set; }
```